# BuiltInFailures.MatchlineFailures Class

---
Failures about Matchline.
SystemObject Autodesk.Revit.DBBuiltInFailuresMatchlineFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class MatchlineFailures

    Public NotInheritable Class MatchlineFailures

    public ref class MatchlineFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type MatchlineFailures = class end
The BuiltInFailuresMatchlineFailures type exposes the following members.
| Name| Description
---|---|---
| CreationFailed|  Matchline top extent should be higher than its bottom.
Top
#### Reference
Autodesk.Revit.DB Namespace